trade_exp/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Пользователи</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="d7cfc87f-ac09-44aa-91d9-6511c408c5cb">
    <name>ФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cc8e3172-491d-45d8-a7eb-fc6c400845cb">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ae6d0e12-8857-476c-b4b2-f03295cbed3e">
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="d6969c1e-e13c-4542-abb7-9cf6bb50b8e2">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="bbbfb817-8db3-4415-86c3-af028276d6e9">
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="aa7d5ca4-3c02-4ca1-a790-2435ee9f9f02">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Сотрудники</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="b57ce5b7-9e28-4f84-a668-467a507068c3">
    <name>Должность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="613a9982-ea2e-40bd-b0e1-5642e976be87">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c97fb60c-ec2d-420a-93a9-39602a2bbfdf">
    <name>Уволен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="18560314-7951-472c-8aac-2a5b52d0acfe">
    <name>Отдел</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bf0376ac-0d78-4ccb-88b0-6fb290797677">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="aa27d4c3-5c6c-4d49-bc20-f0d9faedd48f">
    <name>РольОПШ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4f20e46f-464f-4f7c-85f2-c2ceb761c7ca">
    <name>ДатаУвольнения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ea584be0-70fa-40c6-9056-0ac6d48f5544">
    <name>ДатаПриема</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="93190e85-82b5-4f8d-86d4-60a3ed158497">
    <name>ИзменятьТребуетПодтверждение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ae0a6a00-9b29-4553-88a2-43a85bee5a3a">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2c716114-b753-459f-820d-3eefc10412b6">
    <name>ИдентификаторМобильногоПриложения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d0e3a882-dc26-453d-ae18-394afecbe606">
    <name>ЦельПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e140be66-a953-4235-9404-eb1e4326c329">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e204e166-c00a-4107-b2f6-e178a0260ea2">
    <name>ПотребностьВСлужебномТранспорте</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8e321359-c912-4451-9965-e660dd87561c">
    <name>ВГрафике</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="75ed98aa-60db-49f8-9e60-419549eea6b0">
    <name>Касса</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="81ba44aa-675f-4a78-bd9e-bd949a5d139f">
    <name>ФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3c56826a-54b5-44f6-b674-4f57e9006ae4">
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c365c143-4ee2-4da0-840a-f5707c956f21">
    <name>ИзменятьЦель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1bad7ab2-c198-4c43-a6cd-a4c4dcb497cf">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="824f90f8-db60-4eee-ae25-c8da8bd31141">
    <name>Телефон</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="46ca7a78-d4ae-44ee-8d05-a15add9f79c4">
    <name>ПутьДляФотоСТСД</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7b035ccb-950d-48ec-ba42-fbcf94fe0d51">
    <name>УстанавливатьПериодНеПозднее</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7162254b-c2fe-4139-94ea-cc0f720a9b3d">
    <name>ИзменятьТипПропуска</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="961c74cb-fce1-43c3-af7f-b67d404817cb">
    <name>КассаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6667f724-4527-4af9-9d26-f2ced65f4ed5">
    <name>ВыгружатьНаСайт</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e43fec11-e2d6-4ba1-935e-cfc4047484d6">
    <name>Индивидуально</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="35688e1d-3d5d-4ba4-a2d2-a8ae02028ceb">
    <name>УровеньДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9dfb1156-61b0-4cf6-a749-49cf491b66af">
    <name>ЗапретитьСоздаватьПропуск</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="662ef78d-bb7a-4142-8543-46c55d375e3a">
    <name>ИзменятьПодразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0983b722-4b9b-4508-9502-eadb41d5ef36">
    <name>ТабельныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="25fb4b64-3389-40d8-a0fb-1a48696c5f69">
    <name>ДатаПеревода</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="de354010-7d67-44cf-87d4-e48af516a477">
    <name>РольМобильногоКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6020fb7b-5fb1-4cf3-a1df-ee412178682d">
    <name>ДолжностьЗУП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="44079ee7-c820-4e7e-90b6-b558be1c261a">
    <name>ПодразделениеЗУП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ae05a309-265f-484f-b720-0b93517910b0">
    <name>ОповещенияИзОчереди</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6d6189b4-cd43-4428-b345-8c04fb2cba4c">
    <name>ВышестоящееПодразделениеЗУП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="df0fd9e1-cd5c-4ecd-9102-493f1dbba937">
    <name>ВнутреннийТелефон</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="41e900a7-c10f-4f56-bc62-69d7108bc92e">
    <name>КорпоративныйТелефон</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1973c897-b5f8-4020-b1e7-47881040abeb">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0fdb6ac0-b230-43d6-b6e7-bd153e64f5a0">
    <name>Удаленщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7fb666be-2e07-4d2e-8843-dcec84180a27">
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d44aa133-8703-4fc0-b5ff-67b13c6f1ea4">
    <name>ДопУтверждениеББ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="57989287-32be-4a51-8f5a-0c9a27b45041">
    <name>ПравоНаПроверку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0150eb34-5757-4b0a-b42e-18cb40c1f263">
    <name>ПравоНаСогласование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ba7e389d-4b02-43cb-9a13-1b3a0f9a4be1">
    <name>Аутсорс</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="de79966c-ad14-441f-95c9-e94a04bef8bc">
    <name>СписокЗон</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="a6561ebb-def2-4423-834a-41631f1b243a">
      <name>ЗонаДоступа</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="aff5c93c-abdd-44ce-86ba-3df5ea78303d">
    <name>РабочиеУчастки</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e6045355-ff14-41a0-a6e6-dba35c5249a7">
      <name>РабочийУчасток</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="e6b14f6a-ed6b-424d-92dd-c34e7f8b22e6">
    <name>БейджыВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="d1e828b1-f591-4c25-9e7e-aeef3e67afb2">
      <name>ТранспортноеСредство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="806f21ff-78a2-4496-90c9-dfd5253a5be0">
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>15</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="69aeacfc-4a6b-4d95-9201-ae704bbb53c0">
      <name>Наименование</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>60</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Catalogs/Пользователи/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция СписокМестИспользования(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =                         
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Ссылка,
		|	Сотрудники.Пользователь КАК Пользователь,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Сотрудники.ПометкаУдаления КАК ПометкаУдаления,
		|	Сотрудники.Уволен КАК Уволен
		|ПОМЕСТИТЬ ВТСотрудники
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	&Условие
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Ссылка,
		|	Сотрудники.Пользователь КАК Пользователь,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТДействующиеСотрудники
		|ИЗ
		|	ВТСотрудники КАК Сотрудники
		|ГДЕ
		|	НЕ Сотрудники.ПометкаУдаления
		|	И НЕ Сотрудники.Уволен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Ссылка,
		|	Сотрудники.Пользователь КАК Пользователь,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТУволенныеСотрудники
		|ИЗ
		|	ВТСотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Уволен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УволенныеСотрудники.Ссылка КАК Сотрудник,
		|	Пользователи.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТУволенныеПользователи
		|ИЗ
		|	ВТУволенныеСотрудники КАК УволенныеСотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО УволенныеСотрудники.Пользователь = Пользователи.Ссылка
		|ГДЕ
		|	НЕ Пользователи.Ссылка В
		|				(ВЫБРАТЬ
		|					ВТДействующиеСотрудники.Пользователь КАК Пользователь
		|				ИЗ
		|					ВТДействующиеСотрудники)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УволенныеСотрудники.Ссылка КАК Сотрудник,
		|	ФизЛица.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТУволенныеФизЛица
		|ИЗ
		|	ВТУволенныеСотрудники КАК УволенныеСотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизЛица
		|		ПО УволенныеСотрудники.ФизическоеЛицо = ФизЛица.Ссылка
		|ГДЕ
		|	НЕ ФизЛица.Ссылка В
		|				(ВЫБРАТЬ
		|					ВТДействующиеСотрудники.ФизическоеЛицо КАК ФизическоеЛицо
		|				ИЗ
		|					ВТДействующиеСотрудники)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Отделы.Ссылка КАК Ссылка,
		|	Сотрудники.Ссылка КАК Сотрудник,
		|	""Справочник 'Отделы', реквизит 'Руководитель'"" КАК МестоИспользования,
		|	""Руководитель"" КАК НазваниеРеквизита,
		|	""Ссылка"" КАК НеобходимыйСправочникДляЗаписи
		|ИЗ
		|	Справочник.Отделы КАК Отделы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТУволенныеСотрудники КАК Сотрудники
		|		ПО Отделы.Руководитель = Сотрудники.Ссылка
		|ГДЕ
		|	НЕ Отделы.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РабочиеУчастки.Ссылка,
		|	Сотрудники.Ссылка,
		|	""Справочник 'Рабочие участки', реквизит 'Руководитель'"",
		|	""Руководитель"",
		|	""Ссылка""
		|ИЗ
		|	Справочник.РабочиеУчастки КАК РабочиеУчастки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТУволенныеСотрудники КАК Сотрудники
		|		ПО РабочиеУчастки.Руководитель = Сотрудники.Ссылка
		|ГДЕ
		|	НЕ РабочиеУчастки.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтруктураПредприятия.Ссылка,
		|	Пользователи.Сотрудник,
		|	""Справочник 'Структура предприятия', реквизит 'Бухгалтер подразделения'"",
		|	""БухгалтерПодразделения"",
		|	""Пользователь""
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТУволенныеПользователи КАК Пользователи
		|		ПО СтруктураПредприятия.БухгалтерПодразделения = Пользователи.Ссылка
		|ГДЕ
		|	СтруктураПредприятия.БухгалтерПодразделения <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|	И НЕ СтруктураПредприятия.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтруктураПредприятия.Ссылка,
		|	Пользователи.Сотрудник,
		|	""Справочник 'Структура предприятия', реквизит 'Администратор ТЗ'"",
		|	""АдминистраторТЗ"",
		|	""Пользователь""
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТУволенныеПользователи КАК Пользователи
		|		ПО СтруктураПредприятия.АдминистраторТЗ = Пользователи.Ссылка
		|ГДЕ
		|	СтруктураПредприятия.АдминистраторТЗ <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|	И НЕ СтруктураПредприятия.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтруктураПредприятия.Ссылка,
		|	Пользователи.Сотрудник,
		|	""Справочник 'Структура предприятия', реквизит 'Управляющий ТСК'"",
		|	""УправляющийТСК"",
		|	""Пользователь""
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТУволенныеПользователи КАК Пользователи
		|		ПО СтруктураПредприятия.УправляющийТСК = Пользователи.Ссылка
		|ГДЕ
		|	СтруктураПредприятия.УправляющийТСК <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|	И НЕ СтруктураПредприятия.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтруктураПредприятия.Ссылка,
		|	ФизЛица.Сотрудник,
		|	""Справочник 'Структура предприятия', реквизит 'Руководитель подразделения'"",
		|	""ТекущийРуководитель"",
		|	""ФизическоеЛицо""
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТУволенныеФизЛица КАК ФизЛица
		|		ПО СтруктураПредприятия.ТекущийРуководитель = ФизЛица.Ссылка
		|ГДЕ
		|	СтруктураПредприятия.ТекущийРуководитель <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|	И НЕ СтруктураПредприятия.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РассылкиОтчетов.Ссылка,
		|	Пользователи.Сотрудник,
		|	""Справочник 'Рассылки отчетов', реквизит 'Ответственный'"",
		|	""Автор"",
		|	""Пользователь""
		|ИЗ
		|	Справочник.РассылкиОтчетов КАК РассылкиОтчетов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТУволенныеПользователи КАК Пользователи
		|		ПО РассылкиОтчетов.Автор = Пользователи.Ссылка
		|ГДЕ
		|	РассылкиОтчетов.Подготовлена
		|	И РассылкиОтчетов.Автор <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|	И НЕ РассылкиОтчетов.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудник,
		|	Ссылка";
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст, 
			"&Условие", 
			"Сотрудники.Ссылка = &Ссылка ИЛИ Сотрудники.Пользователь = &Ссылка ИЛИ Сотрудники.ФизическоеЛицо = &Ссылка");
			
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Иначе
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст, 
			"&Условие", 
			"ИСТИНА");
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
 
КонецФункции

#КонецЕсли
